export const INTERESTS_LIST = [
  '게임',
  '캠핑',
  '헬스장',
  '노래방',
  '여행',
  '카페',
  '호캉스',
  '독서',
  '사진',
  '만화',
  '영화',
  '애니메이션',
  'PC방',
  '치맥',
  '한강',
  '와인',
  '카공',
  '맛집 탐방',
  '주식/투자',
  '독서',
  '음악 감상',
  '드라이브',
  '자기계발',
  '요리',
  '드로잉',
  '악기연주'
] as const;


/**
 * @swagger
 * components:
 *   schemas:
 *     Interests:
 *       type: array
 *       items:
 *         type: string
 *         enum:
 *           - '게임'
 *           - '캠핑'
 *           - '헬스장'
 *           - '노래방'
 *           - '여행'
 *           - '카페'
 *           - '호캉스'
 *           - '독서'
 *           - '사진'
 *           - '만화'
 *           - '영화'
 *           - '애니메이션'
 *           - 'PC방'
 *           - '치맥'
 *           - '한강'
 *           - '와인'
 *           - '카공'
 *           - '맛집 탐방'
 *           - '주식/투자'
 *           - '독서'
 *           - '음악 감상'
 *           - '드라이브'
 *           - '자기계발'
 *           - '요리'
 *           - '드로잉'
 *           - '악기연주'
 *       description: 사용 가능한 관심사 목록.
 *       example: ['여행', '독서']
 */
export type Interests = typeof INTERESTS_LIST[number][];